Управление_торговлей.ПБТ/src/DataProcessors/вт_ВводПроизводствоПоЖурналу/вт_ВводПроизводствоПоЖурналу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вт_ВводПроизводствоПоЖурналу</name>
  <comment>Показывает текущие заказы на производство и позволяет одной кнопкой ввести производство. Как в MCDonalds</comment>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/Enums/вт_ВидыОперацийПроизводства/вт_ВидыОперацийПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вт_ВидыОперацийПроизводства</name>
  <enumValues>
    <name>СобственноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоДляЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеИзПроизводства</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/вт_ЗаказВПроизводство/вт_ЗаказВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ЗаказВПроизводство</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.вт_ЗаказВПроизводство</basedOn>
  <registerRecords>AccumulationRegister.вт_ОперацииВыпускаПродукции</registerRecords>
  <registerRecords>AccumulationRegister.вт_ОперацииВыпускаСырье</registerRecords>
  <registerRecords>AccumulationRegister.вт_ПлановаяСебестоимостьВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.вт_ЗаказВПроизводство</registerRecords>
  <registerRecords>InformationRegister.вт_СтатусыОснованийЗаказовВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>InformationRegister.вт_СтатусыЗаказовВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.вт_СтатусыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуемаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьМатериалы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказВПроизводство</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзмВес</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>п_Ширина</name>
      <comment>Ширина в развороте</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Толщина</name>
      <comment>Толщина пленки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Метраж</name>
      <comment>Метраж,км</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Плотность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_Цвет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>п_ФактураПленки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная себестоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПроизводства</name>
    <comment>Операции производства с привязкой к конкретной продукции</comment>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходСырьяНаОперации</name>
    <comment>Расход сырья при выполнении конкретной операции производства</comment>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиОперации</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура сырья</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/DataProcessors/вт_ВводПроизводствоПоЖурналу/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗаказы.Параметры.УстановитьЗначениеПараметра("КонецДня", КонецДня(ТекущаяДата()));
	СписокЗаказы.Параметры.УстановитьЗначениеПараметра("ТекущийДень", ТолькоТекущийДень);
	
	СписокПроизведено.Параметры.УстановитьЗначениеПараметра("КонецДня", КонецДня(ТекущаяДата()));	  
	
	Объект.Валюта=Константы.ВалютаРегламентированногоУчета.Получить();
	Организация = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_ОрганизацияПроизводства");
	Склад = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_СкладПроизводства");
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.Подразделение) Тогда
		Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;	
	Иначе	
		Подразделение = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_ПодразделениеПроизводства");
	КонецЕсли;
	ВидОперацииПроизводства = Перечисления.вт_ВидыОперацийПроизводства.СобственноеПроизводство;
	СтатьяДоходов = КонстантыСервер.ПолучитьЗначениеКонстанты("вт_СтатьяДоходовПроизводство");
	
	  
КонецПроцедуры

&НаКлиенте
Процедура ТолькоТекущийДеньПриИзменении(Элемент)
	СписокЗаказы.Параметры.УстановитьЗначениеПараметра("ТекущийДень", ТолькоТекущийДень);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроизводство(Команда)
	ТекДанные = Элементы.СписокЗаказы.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите строку с продукцией");
		Возврат;
	КонецЕсли;	
	ДопПараметры = Новый Структура("Номенклатура,Характеристика,ЗаказВПроизводство",ТекДанные.Номенклатура, ТекДанные.Характеристика, ТекДанные.ЗаказПроизводства);
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтаФорма,ДопПараметры);

	ПоказатьВводЧисла(Оповещение,ТекДанные.КоличествоОстаток,"Количество производства");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(КоличествоПроизведено, ПараметрыОповещения) Экспорт
    Если КоличествоПроизведено = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументНаСервере(КоличествоПроизведено, ПараметрыОповещения.Номенклатура, ПараметрыОповещения.Характеристика, ПараметрыОповещения.ЗаказВПроизводство);
	
	Элементы.СписокЗаказы.Обновить();
	Элементы.СписокПроизведено.Обновить();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьДокументНаСервере(КоличествоПродукции,пНоменклатура,пХарактеристика, пЗаказВПроизводство) 
    
    Док = Документы.вт_ОтчетПроизводства.СоздатьДокумент();
	
    Док.Организация = пЗаказВПроизводство.Организация;
    
    Док.Подразделение = Подразделение;
    
    Док.Склад = пЗаказВПроизводство.Склад;
    
    Док.СтатьяДоходов = СтатьяДоходов;
    
    Док.ВидОперацииПроизводства = ВидОперацииПроизводства;
    
    Док.АналитикаДоходов = АналитикаДоходов;
    
    Док.ОтразитьВПроизводственномУчете = ИСТИНА;
	
	Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
    Док.Дата = ТекущаяДатаСеанса();
	
	Док.ДокументОснование = пЗаказВПроизводство;  
	
	КодСтроки = 1;
	
	СтрокаТовары = Док.Товары.Добавить();     
	СтрокаТовары.Номенклатура = пНоменклатура;	
	СтрокаТовары.Характеристика = пХарактеристика;
	СтрокаТовары.Количество     = КоличествоПродукции;
	СтрокаТовары.КоличествоПлан = КоличествоПродукции;
	СтрокаТовары.КодСтроки = КодСтроки;
	
	//получим план расхода сырья по заказу
	Запрос = НовыЙ Запрос("ВЫБРАТЬ
	                      |	вт_ЗаказВПроизводствоСырье.Номенклатура КАК Номенклатура,
	                      |	вт_ЗаказВПроизводствоСырье.Характеристика КАК Характеристика,
	                      |	вт_ЗаказВПроизводствоСырье.Количество КАК КоличествоСырья,
	                      |	вт_ЗаказВПроизводствоТовары.Количество КАК КоличествоПродукции,
	                      |	вт_ЗаказВПроизводствоТовары.ВариантПроизводства КАК ВариантПроизводства,
	                      |	вт_ЗаказВПроизводствоТовары.Ссылка.Организация КАК Организация,
	                      |	вт_ЗаказВПроизводствоТовары.Ссылка.Склад КАК Склад
	                      |ИЗ
	                      |	Документ.вт_ЗаказВПроизводство.Товары КАК вт_ЗаказВПроизводствоТовары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.вт_ЗаказВПроизводство.Сырье КАК вт_ЗаказВПроизводствоСырье
	                      |		ПО вт_ЗаказВПроизводствоТовары.Ссылка = вт_ЗаказВПроизводствоСырье.Ссылка
	                      |			И вт_ЗаказВПроизводствоТовары.КлючСтроки = вт_ЗаказВПроизводствоСырье.КлючСвязиСтроки
	                      |ГДЕ
	                      |	вт_ЗаказВПроизводствоСырье.Ссылка = &Ссылка
	                      |	И вт_ЗаказВПроизводствоТовары.Номенклатура = &Номенклатура
	                      |	И вт_ЗаказВПроизводствоТовары.Характеристика = &Характеристика
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	вт_ЗаказВПроизводствоСырье.НомерСтроки");
	
	Запрос.УстановитьПараметр("ссылка",пЗаказВПроизводство);
	Запрос.УстановитьПараметр("Номенклатура",пНоменклатура);
	Запрос.УстановитьПараметр("Характеристика",пХарактеристика);
	ВыборкаСырье = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСырье.Следующий() Цикл
		
		СтрокаТоварыСырье = Док.вт_ПроизводствоСырье.Добавить(); 
		СтрокаТоварыСырье.КлючСвязиСтроки  = КодСтроки; 
		СтрокаТоварыСырье.ГотоваяПродукция = пНоменклатура; 
		
		СтрокаТоварыСырье.Номенклатура = ВыборкаСырье.Номенклатура; 
		СтрокаТоварыСырье.Характеристика = ВыборкаСырье.Характеристика;
		
		НормаРасхода = ВыборкаСырье.КоличествоСырья / ВыборкаСырье.КоличествоПродукции;
		
		СтрокаТоварыСырье.Количество = НормаРасхода * КоличествоПродукции; 
		СтрокаТоварыСырье.КоличествоПлан = СтрокаТоварыСырье.Количество;
	КонецЦикла;
	
	//Заполним ставки для оплаты если есть физ.лицо по ответственному и если заданы ставки
	
	ФизЛицоОтветств = Док.Ответственный.ФизическоеЛицо;
	Если ЗначениеЗаполнено(ФизЛицоОтветств) тогда
		 Док.Записать(РежимЗаписиДокумента.Запись);
		 Док.ЗаполнитьТаблицуТарифовПоСотруднику(ФизЛицоОтветств);
	КонецЕсли;
	
	
    Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.СписокЗаказы.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите строку с продукцией");
		Возврат;
	КонецЕсли;	
	ПоказатьЗначение(,ТекДанные.ЗаказПроизводства);
КонецПроцедуры

&НаКлиенте
Процедура СписокПроизведеноВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.СписокПроизведено.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		ПоказатьОповещениеПользователя("Выберите строку с продукцией");
		Возврат;
	КонецЕсли;	
	ПоказатьЗначение(,ТекДанные.Регистратор);

КонецПроцедуры
